app/controllers/raiders_controller.rb

SELECT "raiders".* FROM "raiders"
---
  def index
    @raiders = Raider.all

INSERT INTO "raiders" ("name", "power", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Barbfrag"], ["power", 9], ["user_id", 11], ["created_at", "2018-07-02 14:50:30.108206"], ["updated_at", "2018-07-02 14:50:30.108206"]]
---
  def create
    @raider = Raider.new(raider_params)

    if @raider.save

UPDATE "raiders" SET "name" = $1, "power" = $2, "updated_at" = $3 WHERE "raiders"."id" = $4  [["name", "a"], ["power", 12], ["updated_at", "2018-07-16 02:33:30.989207"], ["id", 2]]
---
  def update
    if @raider.update(raider_params)

DELETE FROM "raiders" WHERE "raiders"."id" = $1  [["id", 2]]
---
  def destroy
    @raider.destroy

SELECT  "raiders".* FROM "raiders" WHERE "raiders"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_raider
      @raider = Raider.find(params[:id])